planeMixingLayer_singlePhase/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0.075 0);

boundaryField
{
    INLET1
    {
        type               fixedValue;
        value              uniform (0 0.6 0);
    }
    
	INLET2
    {
        type               fixedValue;
        value              uniform (0 0.94 0);
    }

    OUTLET
    {
        type               zeroGradient;
    }

    WALLS
    {
        type               fixedValue;
        value              uniform (0 0 0);
    }
}

// ************************************************************************* //
