planeMixingLayer_singlePhase/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-3;

boundaryField
{
    INLET1
    {
        type            calculated;
        value           $internalField;
    }

    INLET2
    {
        type            calculated;
        value           $internalField;
    }

    OUTLET
    {
        type            calculated;
        value           $internalField;
    }

    WALLS
    {
        type            nutkWallFunction;
	    //type			zeroGradient;
        value           $internalField;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
